QGDsolver/tutorials/reactingQGDFoam/1D/Sod/Sod_RR/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.01 -0.01)   //0
    (1 -0.01 -0.01)   //1
    (1  0.01 -0.01)   //2
    (0  0.01 -0.01)   //3
    (0 -0.01  0.01)   //4
    (1 -0.01  0.01)   //5
    (1  0.01  0.01)   //6
    (0  0.01  0.01)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sideLeft
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    sideRight
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    empty1
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    empty2
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (5 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
